-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 30, 2024 at 08:15 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `yourtatse`
--

-- --------------------------------------------------------

--
-- Table structure for table `choices`
--

CREATE TABLE `choices` (
  `id` int(11) NOT NULL,
  `question_id` int(11) DEFAULT NULL,
  `choice_text` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `choices`
--

INSERT INTO `choices` (`id`, `question_id`, `choice_text`) VALUES
(1, 1, 'ให้เห็นว่าคุณเป็นเพื่อนแกะและร้องเสียงเหมือนแกะ'),
(2, 1, 'พยายามทำท่าทางที่ไม่เป็นธรรมชาติเพื่อระงับความกลัวของสัตว์'),
(3, 1, 'วิ่งหนีเข้าป่าที่ใกล้เคียง'),
(4, 1, 'นั่งอยู่นิ่งๆและรอดูพฤติกรรมของสัตว์'),
(5, 2, 'ความเชื่อมั่นและความเข้ากันทางอารมณ์'),
(6, 2, 'ความรับผิดชอบและความเข้าใจกัน'),
(7, 2, 'ความรู้สึกของการเชื่อมั่นและความเข้าใจที่สอดคล้องกัน'),
(8, 2, 'ถูกเสนอชื่อเข้าร่วมโครงการสำคัญของบริษัท'),
(9, 3, 'หาหัวข้อที่เกี่ยวข้องกับความสามารถและความสนใจของคุณ'),
(10, 3, 'ทำการค้นคว้าและวิเคราะห์ตลาดและความต้องการของลูกค้า'),
(11, 3, 'ติดต่อผู้ที่มีประสบการณ์และคำแนะนำในวงการ'),
(12, 3, 'ทำการวางแผนการเงินและการลงทุนอย่างรอบคอบ'),
(13, 4, 'พิจารณาความสนใจและความสามารถที่มีอยู่'),
(14, 4, 'สำรวจตลาดแรงงานและโอกาสทางอาชีพ'),
(15, 4, 'ปรึกษากับคนในวงการและความคิดเห็นจากบุคคลอื่น'),
(16, 4, 'พิจารณาผลกระทบของการเปลี่ยนงานต่อชีวิตส่วนตัวและครอบครัว'),
(17, 5, 'ใช้แอปพลิเคชันนำทางเลือกเส้นทางที่เป็นไปได้ที่สุด'),
(18, 5, 'รอให้การจราจรลดลงและเดินทางต่อเมื่อสะดวก'),
(19, 5, 'หาทางเลือกเส้นทางการเดินทางอื่นเพื่อหลีกเลี่ยงการติดขัด'),
(20, 5, 'ทนต่อการติดขัดและเดินทางต่อไปตามเส้นทางปกติ'),
(21, 6, 'ลองเชื่อมต่อเครือข่าย Wi-Fi อื่นๆ'),
(22, 6, 'รอให้เครือข่ายกลับมาทำงานอีกครั้งแล้วลองส่ง'),
(23, 6, 'ขอร้องความช่วยเหลือจากผู้ดูแลระบบเครือข่าย'),
(24, 6, 'ใช้โทรศัพท์มือถือเพื่อส่งอีเมล์ผ่านข้อมูลเครือข่ายโทรศัพท์เคลื่อนที่'),
(25, 7, 'ติดต่อทีมงานและร่วมกันหาทางแก้ไขปัญหา'),
(26, 7, 'สร้างแผนการป้องกันข้อผิดพลาดในอนาคต'),
(27, 7, 'สร้างรายงานและอธิบายสาเหตุของข้อผิดพลาด'),
(28, 7, 'ติดตามและปรับปรุงกระบวนการทำงานเพื่อป้องกันการเกิดข้อผิดพลาดในอนาคต'),
(29, 8, 'ลงทะเบียนเรียนคอร์สออนไลน์ที่มีบทเรียนที่คล้ายกับสไตล์การเรียนของคุณ'),
(30, 8, 'ร่วมกิจกรรมกับชุมชนที่มีผู้ใช้งานภาษาต่างๆ'),
(31, 8, 'จัดตารางเวลาและวางแผนการเรียนอย่างรอบคอบ'),
(32, 8, 'หาครูสอนส่วนตัวที่มีประสบการณ์และทักษะที่เหมาะสม'),
(33, 9, 'จัดการศึกษาด้วยตนเองโดยใช้หนังสือและเนื้อหาออนไลน์'),
(34, 9, 'สมัครเรียนคอร์สออนไลน์จากแหล่งการเรียนรู้ที่เชื่อถือได้'),
(35, 9, 'ร่วมกิจกรรมที่เกี่ยวข้องและได้รับความช่วยเหลือจากผู้เชี่ยวชาญ'),
(36, 9, 'สร้างโครงการหรือโมเดลทดลองเพื่อประยุกต์ใช้ทักษะที่ได้เรียนรู้'),
(37, 10, 'สร้างโอกาสให้สมาชิกทีมได้แสดงความคิดเห็นและเสนอแนวคิดใหม่ๆ'),
(38, 10, 'จัดทำแผนกิจกรรมสีสันและน่าสนใจสำหรับทีม'),
(39, 10, 'สร้างระบบการสะท้อนกลับและการชำระเงินพิเศษสำหรับสมาชิกทีมที่มีผลงานดี'),
(40, 10, 'จัดอบรมและพัฒนาทักษะของสมาชิกทีมเพื่อเสริมสร้างการทำงานเป็นทีมที่ดีขึ้น'),
(41, 11, 'ส่งเครื่องหมายความเคารพและขอบคุณอย่างสม่ำเสมอ'),
(42, 11, 'สร้างสภาพแวดล้อมที่เป็นกันเองและสนับสนุน'),
(43, 11, 'สร้างโอกาสให้สมาชิกมีโอกาสเรียนรู้และพัฒนาทักษะ'),
(44, 11, 'ให้คำปรึกษาและความเข้าใจต่อความต้องการและความสมบูรณ์ของสมาชิกในทีม'),
(45, 12, 'ปรึกษากับบุคคลที่มีอำนาจหรือความสำคัญในองค์กร'),
(46, 12, 'พูดคุยโดยตรงกับบุคคลที่มีข้อขัดแย้งเพื่อหาวิธีการแก้ไข'),
(47, 12, 'ใช้กระบวนการสื่อสารที่เปิดเผยและต่อเนื่อง'),
(48, 12, 'ควบคุมอารมณ์และพยายามหาทางที่เป็นมิตรและสร้างสรรค์ในการแก้ไขปัญหาม');

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` int(11) NOT NULL,
  `question_text` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`id`, `question_text`) VALUES
(1, 'คุณกำลังเดินอยู่ในป่าและเจอสัตว์ป่าขนาดใหญ่กำลังจะเข้าใกล้คุณ คุณจะกระทำอย่างไร?'),
(2, 'ในการเลือกคู่สมรสหรือคู่รักในชีวิตส่วนตัว คุณให้ความสำคัญกับคุณลักษณะใดของคู่ครอง?'),
(3, 'คุณต้องการเริ่มต้นธุรกิจของคุณเอง คุณจะเลือกทำอย่างไร?'),
(4, 'เมื่อคุณต้องการที่จะทำการเปลี่ยนงาน คุณจะค้นหาอาชีพใหม่อย่างไร?'),
(5, 'คุณกำลังเดินทางไปที่ปลายทางและพบกับการติดขัดทางการจราจรหนัก คุณจะจัดการอย่างไร?'),
(6, 'เมื่อคุณอยู่ในที่งานและต้องการส่งอีเมล์สำคัญ แต่พบว่าเครือข่ายอินเตอร์เน็ตขัดข้อง คุณจะดำเนินการอย่างไร?'),
(7, 'เมื่อเกิดข้อผิดพลาดในโปรเจกต์ที่คุณรับผิดชอบ คุณจะแก้ไขอย่างไร?'),
(8, 'คุณต้องการที่จะเริ่มต้นการเรียนรู้ภาษาใหม่ คุณจะเลือกเรียนอย่างไร?'),
(9, 'เมื่อคุณต้องการที่จะพัฒนาทักษะใหม่ คุณจะเลือกใช้ออกแบบการเรียนรู้อย่างไร?'),
(10, 'เมื่อคุณต้องการเพิ่มความคุ้มค่าให้กับการทำงานทีม คุณจะกระทำอย่างไร?'),
(11, 'เมื่อคุณต้องการเพิ่มพลังให้กับสมาชิกในทีม คุณจะใช้อะไร?'),
(12, 'เมื่อคุณต้องการแก้ไขข้อขัดแย้งในการทำงาน คุณจะใช้วิธีใด?');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `choices`
--
ALTER TABLE `choices`
  ADD PRIMARY KEY (`id`),
  ADD KEY `question_id` (`question_id`);

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `choices`
--
ALTER TABLE `choices`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;

--
-- AUTO_INCREMENT for table `questions`
--
ALTER TABLE `questions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `choices`
--
ALTER TABLE `choices`
  ADD CONSTRAINT `choices_ibfk_1` FOREIGN KEY (`question_id`) REFERENCES `questions` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
